{
  "A-10": "Twin-turbofan engines mounted high above the rear fuselage in external nacelles; straight, high-aspect-ratio wings positioned low on the fuselage; twin vertical stabilizers (twin-tail) mounted at the tips of the horizontal stabilizers; large squared-off nose housing the GAU-8 cannon; pronounced anhedral on wings; tricycle landing gear with main wheels partially exposed when retracted.",
  "A-400M": "Four turboprop engines with six-bladed propellers mounted on high-set straight wings; T-tail configuration with horizontal stabilizer mounted atop the vertical fin; upswept rear fuselage with rear cargo ramp; relatively short and wide fuselage; wing-mounted landing gear.",
  "AG-600": "Four turboprop engines mounted on high gull wings; boat-hull fuselage for amphibious operations; T-tail configuration; wing-mounted floats for water stability; straight, high aspect ratio wings with gull-wing anhedral at root; retractable tricycle landing gear for land operations.",
  "AV-8B": "Single turbofan engine with four rotating exhaust nozzles for vertical thrust; shoulder-mounted straight wings with pronounced anhedral; raised cockpit with large bubble canopy; twin outrigger landing gear under wings in addition to nose and main gear; single vertical stabilizer; two engine air intakes mounted on fuselage sides.",
  "B-1": "Four turbofan engines grouped in pairs under the fuselage; variable-sweep wings that pivot from 15 to 67.5 degrees; blend-body design with long, slender fuselage; small fixed wing glove section; single vertical stabilizer; chin-mounted air intakes with splitter plates; tricycle landing gear.",
  "B-2": "Flying wing design with no vertical tail surfaces; smooth, continuous swept-wing planform resembling a boomerang or flattened triangle; twin turbofan engines buried within the wing structure; sawtooth trailing edge; extremely flat profile; retractable landing gear.",
  "B-52": "Eight turbojet engines mounted in four twin-engine pods beneath a high-mounted, swept wing; tall vertical stabilizer; bicycle-type main landing gear with outriggers under the wings; drooping wing tips requiring small outrigger wheels; long, narrow fuselage; distinctive nose with large windows for bombardier/navigator positions.",
  "Be-200": "Twin turbofan engines mounted on pylons above the rear fuselage; T-tail configuration; high-mounted gull wings with pronounced anhedral at root; boat-hull fuselage for amphibious water landings; retractable tricycle landing gear; water scoops under fuselage for firefighting.",
  "C-130": "Four turboprop engines with four-bladed propellers mounted on high, straight, constant-chord wings; traditional tail with single vertical stabilizer; upswept rear fuselage with cargo ramp; large, boxy fuselage; main landing gear housed in external fairings along fuselage sides.",
  "C-17": "Four turbofan engines mounted under a high-mounted wing with slight anhedral; T-tail configuration with horizontal stabilizer mounted high on vertical fin; upswept rear fuselage with cargo ramp; supercritical wing design with winglets; tricycle landing gear; wide fuselage for oversized cargo.",
  "C-2": "Twin turboprop engines mounted on high straight wings; distinctive triple-tail configuration with vertical stabilizers mounted outboard on horizontal stabilizer; high wing loading; upswept rear fuselage; retractable tricycle landing gear; large external engine nacelles.",
  "C-5": "Four turbofan engines mounted on pylons beneath a 25-degree swept, high-mounted wing; T-tail configuration; upward-hinged nose visor for front cargo loading; upswept rear fuselage with rear cargo ramp; 28-wheel landing gear system; very large fuselage; kneeling landing gear capability for cargo loading.",
  "E-2": "Twin turboprop engines on high straight wings; distinctive 24-foot diameter rotating radome (radar dish) mounted above the fuselage on struts; quadruple vertical tail configuration with four fins; high wing with slight dihedral; carrier-capable with folding wings; tricycle landing gear with tail hook.",
  "E-7": "Twin turbofan engines mounted under swept wings; distinctive dorsal-mounted wedge-shaped radar array (top-hat radome) above the fuselage; conventional tail with single vertical stabilizer and low-mounted horizontal stabilizers; swept wings; standard commercial airliner configuration based on Boeing 737.",
  "EF-2000": "Twin turbofan engines with rectangular afterburner nozzles; canard-delta wing configuration with small foreplanes ahead of the main delta wings; twin canted vertical stabilizers; compound-sweep delta wings with 53-degree leading edge sweep; chin-mounted air intake; quadruple-redundant fly-by-wire system; tricycle landing gear.",
  "F-117": "Twin turbofan engines with flat, slit-shaped exhaust nozzles; faceted airframe composed entirely of flat triangular panels; V-shaped butterfly tail (no vertical stabilizer); platypus-shaped extended tail section; sharp, angular nose; no curved surfaces; serrated panel edges; exhaust shielded from below.",
  "F-14": "Twin turbofan engines with widely-spaced nacelles featuring ventral fins; variable-sweep wings pivoting from 20 to 68 degrees; twin vertical stabilizers (twin-tail); distinctive box-like fuselage pancake; wing gloves with fixed sections housing weapons; all-moving horizontal tailplanes (tailerons); widely-spaced engine intakes; retractable landing gear.",
  "F-15": "Twin turbofan engines mounted side-by-side with rectangular intakes and no exhaust petals; twin vertical stabilizers canted slightly outward; high-mounted wings with 45-degree sweep; broad, flat fuselage spine; large one-piece bubble canopy; all-moving horizontal stabilizers; shoulder-mounted air intakes; conspicuous lack of turkey-feather exhaust petals.",
  "F-16": "Single turbofan engine with single ventral air intake beneath fuselage; cropped-delta wing with wing-fuselage blending; single vertical stabilizer; pair of ventral fins beneath aft fuselage; frameless bubble canopy; all-moving horizontal stabilizers (stabilators); relatively small, compact airframe; belly-mounted intake with splitter plate.",
  "F/A-18": "Twin turbofan engines with square air intakes and leading-edge extensions (LEX); twin canted vertical stabilizers; trapezoidal wings with moderate sweep; prominent leading edge root extensions creating vortices; all-moving horizontal stabilizers; tricycle landing gear with tail hook for carrier operations; distinctive LEX fences.",
  "F-22": "Twin turbofan engines with rectangular, 2D thrust-vectoring exhaust nozzles; trapezoidal wings with 42-degree leading edge sweep and clipped diamond shape; twin vertical stabilizers canted outward; all-moving horizontal stabilizers; chined forebody and wing leading-edge root extensions (LERX); internal weapons bays; serrated edges on panels.",
  "F-35": "Single turbofan engine with conventional or lift-fan configuration (variant-dependent); trapezoidal wings with moderate sweep; twin vertical stabilizers canted outward for stealth; all-moving horizontal stabilizers (stabilators); chined fuselage; diverterless supersonic inlet (DSI bump intake); faceted surfaces with continuous curvature; internal weapons bays.",
  "F-4": "Twin turbojet engines with large rectangular intakes and prominent exhaust nozzles; dihedral stabilator (upward-angled horizontal tail); 12-degree anhedral on outer wing panels with pronounced upward dihedral on the tailplane; swept wings and tail surfaces; two-seat tandem cockpit; drooping ailerons; distinctive bent appearance when viewed from front.",
  "J-20": "Twin turbofan engines with closely-spaced nozzles; canard-delta configuration with all-moving canards forward of delta wings; twin canted vertical stabilizers; long, slender fuselage with chined forebody; ventral fins under rear fuselage; DSI bump air intakes; faceted surfaces; internal weapons bays.",
  "JAS-39": "Single turbofan engine with ventral air intake; close-coupled canard-delta wing configuration with canards just ahead of main wings; single vertical stabilizer; delta wings with compound sweep; compact, lightweight airframe; retractable landing gear; relatively small overall size.",
  "MQ-9": "Single turboprop engine with pusher propeller at rear; inverted-V tail (butterfly tail) configuration; long, slender fuselage with bulbous sensor turret under nose; high-aspect-ratio straight wings with slight dihedral; retractable tricycle landing gear; external hardpoints under wings; endurance-optimized design.",
  "Mig-31": "Twin turbofan engines with large rectangular intakes and prominent afterburner nozzles; twin vertical stabilizers mounted on engine nacelles; mid-mounted swept wings; side-by-side two-seat cockpit; large flat fuselage spine; ventral fins beneath engines; anhedral on horizontal stabilizers.",
  "Mirage2000": "Single turbofan engine with two semi-circular intakes on fuselage sides; pure delta wing with no horizontal tail; single vertical stabilizer; compound-curve delta wing with 58-degree leading edge sweep; low-mounted delta wing; small strakes on fuselage sides; retractable tricycle landing gear.",
  "P-3": "Four turboprop engines with four-bladed propellers on low straight wings; conventional tail with single vertical stabilizer; long, slender fuselage derived from airliner design; MAD (Magnetic Anomaly Detector) boom extending from tail; weapons bay in lower fuselage; retractable tricycle landing gear.",
  "RQ-4": "Single turbofan engine buried in fuselage with dorsal intake; extremely long, high-aspect-ratio wings resembling sailplane; V-shaped tail (butterfly configuration); bulbous sensor fairing under forward fuselage; retractable tricycle landing gear; very long fuselage; 130-foot wingspan.",
  "Rafale": "Twin turbofan engines with semi-circular intakes under fuselage; close-coupled canard-delta wing configuration; single vertical stabilizer; compound-sweep delta wings; small all-moving canards close to main wings; moderately swept leading edges; relatively compact airframe; retractable landing gear with carrier hook on naval variant.",
  "SR-71": "Twin turbojet/ramjet engines in long nacelles projecting beyond wing trailing edge; delta wings blending into fuselage chines; twin vertical stabilizers mounted inboard on engine nacelles and canted inward; extremely long, slender fuselage with pronounced chines; movable conical spikes in engine inlets; flat, blended wing-body design; titanium construction.",
  "Su-34": "Twin turbofan engines with widely-spaced nozzles; side-by-side two-seat armored cockpit with flat windscreen; twin vertical stabilizers; swept wings with leading-edge root extensions; distinctive platypus nose; tailboom with sting for rearward radar; retractable landing gear; canard-like control surfaces absent.",
  "Su-57": "Twin turbofan engines with widely-spaced, 3D thrust-vectoring nozzles; trapezoidal wings blended with fuselage; twin all-moving vertical stabilizers canted outward; all-moving horizontal stabilizers; Leading Edge Root Extensions (LERX); faceted airframe with blended wing-body; internal weapons bays; movable leading-edge flaps.",
  "Tornado": "Twin turbofan engines with rectangular intakes; variable-sweep wings pivoting from 25 to 67 degrees; twin vertical stabilizers; shoulder-mounted wing pivot; retractable canards on some variants; two-seat tandem cockpit; distinctive squared-off intakes; wing-mounted landing gear.",
  "Tu-160": "Four turbofan engines in pairs beneath fixed wing gloves; variable-sweep wings pivoting outboard of engine nacelles; single vertical stabilizer; very large, slender fuselage with needle nose; blended wing-body design; retractable landing gear; distinctive white paint scheme; largest combat aircraft by wingspan.",
  "Tu-95": "Four turboprop engines with massive contra-rotating propellers (two sets per engine, eight propeller assemblies total); swept wings mounted mid-fuselage; swept vertical stabilizer and horizontal tail surfaces; very long, slender fuselage; large dorsal gun turret; bicycle-type landing gear with wing-mounted outriggers.",
  "U-2": "Single turbojet engine with intake in fuselage nose; extremely long, high-aspect-ratio straight wings like a glider; bicycle-type landing gear (tandem wheels under fuselage); detachable pogo wheels under wings that fall away on takeoff; single vertical stabilizer; long, slender fuselage.",
  "US-2": "Four turboprop engines on high gull wings; boat-hull fuselage for amphibious operations; T-tail configuration; large sponsons (wing-mounted floats) for water stability; boundary layer control system with blown flaps; upswept rear fuselage; retractable tricycle landing gear.",
  "V-22": "Twin turboprop engines with three-bladed rotors in nacelles that tilt 90 degrees; straight wings with 6-degree forward sweep and dihedral; twin vertical stabilizers; wing-tip mounted engine/rotor nacelles; wings fold for storage; retractable tricycle landing gear; 38-foot diameter rotors.",
  "Vulcan": "Four turbojet engines buried in wing roots; pure delta wing with no horizontal tail; single large vertical stabilizer; smooth, triangular planform with 50-degree leading edge sweep; very wide fuselage blended with delta wing; retractable landing gear with main gear in fuselage.",
  "XB-70": "Six turbojet engines in rectangular box under fuselage; delta wings with variable-geometry wingtips that fold downward up to 65 degrees; twin vertical stabilizers mounted on wingtips; very large canard foreplanes; extremely long fuselage with drooping nose; white thermal-resistant paint; stainless steel and titanium honeycomb construction.",
  "YF-23": "Twin turbofan engines with diamond-shaped, all-moving V-tail surfaces; trapezoidal wings with 40-degree leading edge sweep; no horizontal stabilizers; butterfly tail combining pitch and yaw control; very flat, wide fuselage; chined forebody; serrated trailing edges; engine exhausts buried in wing roots and shielded from below."
}